stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_bus.h
/**
  ******************************************************************************
  * @file    stm32u3xx_ll_bus.h
  * @author  MCD Application Team
  * @brief   Header file of BUS LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB , APB peripherals,  1 dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB , APB peripherals, a dummy read to the peripheral register has been
          inserted in each LL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U3xx_LL_BUS_H
#define STM32U3xx_LL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx.h"

/** @addtogroup STM32U3xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup BUS_LL BUS
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Constants BUS Exported Constants
  * @{
  */

/** @defgroup BUS_LL_EC_AHB1_GRP1_PERIPH  AHB1 GRP1 PERIPH
  * @{
  */
#define LL_AHB1_GRP1_PERIPH_GPDMA1        RCC_AHB1ENR1_GPDMA1EN
#define LL_AHB1_GRP1_PERIPH_ADF1          RCC_AHB1ENR1_ADF1EN
#if defined(HSP1)
#define LL_AHB1_GRP1_PERIPH_HSP1          RCC_AHB1ENR1_HSP1EN
#else
#define LL_AHB1_GRP1_PERIPH_HSP1          0
#endif /* #if defined(HSP1) */
#define LL_AHB1_GRP1_PERIPH_FLASH         RCC_AHB1ENR1_FLASHEN
#define LL_AHB1_GRP1_PERIPH_CRC           RCC_AHB1ENR1_CRCEN
#define LL_AHB1_GRP1_PERIPH_TSC           RCC_AHB1ENR1_TSCEN
#define LL_AHB1_GRP1_PERIPH_RAMCFG        RCC_AHB1ENR1_RAMCFGEN
#define LL_AHB1_GRP1_PERIPH_GTZC1         RCC_AHB1ENR1_GTZC1EN
#define LL_AHB1_GRP1_PERIPH_ICACHE        RCC_AHB1SLPENR1_ICACHESLPEN
#if defined(SRAM4)
#define LL_AHB1_GRP1_PERIPH_SRAM4         RCC_AHB1ENR1_SRAM4EN
#else
#define LL_AHB1_GRP1_PERIPH_SRAM4       0
#endif /* #if defined(SRAM4) */
#define LL_AHB1_GRP1_PERIPH_SRAM1         RCC_AHB1ENR1_SRAM1EN
#define LL_AHB1_GRP1_PERIPH_ALL           (LL_AHB1_GRP1_PERIPH_GPDMA1 | \
                                           LL_AHB1_GRP1_PERIPH_ADF1   | \
                                           LL_AHB1_GRP1_PERIPH_FLASH  | \
                                           LL_AHB1_GRP1_PERIPH_CRC    | \
                                           LL_AHB1_GRP1_PERIPH_TSC    | \
                                           LL_AHB1_GRP1_PERIPH_RAMCFG | \
                                           LL_AHB1_GRP1_PERIPH_GTZC1  | \
                                           LL_AHB1_GRP1_PERIPH_SRAM4  | \
                                           LL_AHB1_GRP1_PERIPH_SRAM1  )
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB1_GRP2_PERIPH  AHB1 GRP2 PERIPH
  * @{
  */
#define LL_AHB1_GRP2_PERIPH_PWR           RCC_AHB1ENR2_PWREN
#define LL_AHB1_GRP2_PERIPH_ALL           RCC_AHB1ENR2_PWREN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB2_GRP1_PERIPH  AHB2 GRP1 PERIPH
  * @{
  */
#define LL_AHB2_GRP1_PERIPH_GPIOA          RCC_AHB2ENR1_GPIOAEN
#define LL_AHB2_GRP1_PERIPH_GPIOB          RCC_AHB2ENR1_GPIOBEN
#define LL_AHB2_GRP1_PERIPH_GPIOC          RCC_AHB2ENR1_GPIOCEN
#define LL_AHB2_GRP1_PERIPH_GPIOD          RCC_AHB2ENR1_GPIODEN
#define LL_AHB2_GRP1_PERIPH_GPIOE          RCC_AHB2ENR1_GPIOEEN
#if defined(GPIOF)
#define LL_AHB2_GRP1_PERIPH_GPIOF          RCC_AHB2ENR1_GPIOFEN
#else
#define LL_AHB2_GRP1_PERIPH_GPIOF          0
#endif /* #if defined(GPIOF) */
#define LL_AHB2_GRP1_PERIPH_GPIOG          RCC_AHB2ENR1_GPIOGEN
#define LL_AHB2_GRP1_PERIPH_GPIOH          RCC_AHB2ENR1_GPIOHEN
#define LL_AHB2_GRP1_PERIPH_ADC12          RCC_AHB2ENR1_ADC12EN
#define LL_AHB2_GRP1_PERIPH_DAC1           RCC_AHB2ENR1_DAC1EN
#if defined(AES)
#define LL_AHB2_GRP1_PERIPH_AES            RCC_AHB2ENR1_AESEN
#else
#define LL_AHB2_GRP1_PERIPH_AES            0
#endif /* #if defined(AES) */
#if defined(HASH)
#define LL_AHB2_GRP1_PERIPH_HASH           RCC_AHB2ENR1_HASHEN
#else
#define LL_AHB2_GRP1_PERIPH_HASH           0
#endif /* #if defined(HASH) */
#if defined(RNG)
#define LL_AHB2_GRP1_PERIPH_RNG            RCC_AHB2ENR1_RNGEN
#else
#define LL_AHB2_GRP1_PERIPH_RNG            0
#endif /* #if defined(RNG) */
#if defined(PKA)
#define LL_AHB2_GRP1_PERIPH_PKA            RCC_AHB2ENR1_PKAEN
#else
#define LL_AHB2_GRP1_PERIPH_PKA            0
#endif /* #if defined(PKA) */
#if defined(SAES)
#define LL_AHB2_GRP1_PERIPH_SAES           RCC_AHB2ENR1_SAESEN
#else
#define LL_AHB2_GRP1_PERIPH_SAES           0
#endif /* #if defined(SAES) */
#if defined(CCB)
#define LL_AHB2_GRP1_PERIPH_CCB            RCC_AHB2ENR1_CCBEN
#else
#define LL_AHB2_GRP1_PERIPH_CCB            0
#endif /* #if defined(CCB) */
#define LL_AHB2_GRP1_PERIPH_SDMMC1         RCC_AHB2ENR1_SDMMC1EN
#define LL_AHB2_GRP1_PERIPH_SRAM2          RCC_AHB2ENR1_SRAM2EN
#if defined(SRAM3)
#define LL_AHB2_GRP1_PERIPH_SRAM3  RCC_AHB2ENR1_SRAM3EN
#else
#define LL_AHB2_GRP1_PERIPH_SRAM3       0
#endif /* #if defined(SRAM3) */
#define LL_AHB2_GRP1_PERIPH_ALL            (LL_AHB2_GRP1_PERIPH_GPIOA  |\
                                            LL_AHB2_GRP1_PERIPH_GPIOB  |\
                                            LL_AHB2_GRP1_PERIPH_GPIOC  |\
                                            LL_AHB2_GRP1_PERIPH_GPIOD  |\
                                            LL_AHB2_GRP1_PERIPH_GPIOE  |\
                                            LL_AHB2_GRP1_PERIPH_GPIOF  |\
                                            LL_AHB2_GRP1_PERIPH_GPIOG  |\
                                            LL_AHB2_GRP1_PERIPH_GPIOH  |\
                                            LL_AHB2_GRP1_PERIPH_ADC12  |\
                                            LL_AHB2_GRP1_PERIPH_DAC1   |\
                                            LL_AHB2_GRP1_PERIPH_AES    |\
                                            LL_AHB2_GRP1_PERIPH_HASH   |\
                                            LL_AHB2_GRP1_PERIPH_RNG    |\
                                            LL_AHB2_GRP1_PERIPH_PKA    |\
                                            LL_AHB2_GRP1_PERIPH_SAES   |\
                                            LL_AHB2_GRP1_PERIPH_CCB    |\
                                            LL_AHB2_GRP1_PERIPH_SDMMC1 |\
                                            LL_AHB2_GRP1_PERIPH_SRAM2  |\
                                            LL_AHB2_GRP1_PERIPH_SRAM3)

/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB2_GRP2_PERIPH  AHB2 GRP2 PERIPH
  * @{
  */
#define LL_AHB2_GRP2_PERIPH_OCTOSPI1       RCC_AHB2ENR2_OCTOSPI1EN
#define LL_AHB2_GRP2_PERIPH_ALL            RCC_AHB2ENR2_OCTOSPI1EN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB1_GRP1_PERIPH  APB1 GRP1 PERIPH
  * @{
  */
#define LL_APB1_GRP1_PERIPH_TIM2          RCC_APB1ENR1_TIM2EN
#define LL_APB1_GRP1_PERIPH_TIM3          RCC_APB1ENR1_TIM3EN
#define LL_APB1_GRP1_PERIPH_TIM4          RCC_APB1ENR1_TIM4EN
#define LL_APB1_GRP1_PERIPH_TIM6          RCC_APB1ENR1_TIM6EN
#define LL_APB1_GRP1_PERIPH_TIM7          RCC_APB1ENR1_TIM7EN
#define LL_APB1_GRP1_PERIPH_SPI3          RCC_APB1ENR1_SPI3EN
#if defined(SPI4)
#define LL_APB1_GRP1_PERIPH_SPI4          RCC_APB1ENR1_SPI4EN
#else
#define LL_APB1_GRP1_PERIPH_SPI4          0
#endif /* #if defined(SPI4) */
#define LL_APB1_GRP1_PERIPH_WWDG          RCC_APB1ENR1_WWDGEN
#define LL_APB1_GRP1_PERIPH_SPI2          RCC_APB1ENR1_SPI2EN
#if defined(USART2)
#define LL_APB1_GRP1_PERIPH_USART2          RCC_APB1ENR1_USART2EN
#else
#define LL_APB1_GRP1_PERIPH_USART2          0
#endif /* #if defined(USART2) */
#define LL_APB1_GRP1_PERIPH_USART3        RCC_APB1ENR1_USART3EN
#define LL_APB1_GRP1_PERIPH_UART4         RCC_APB1ENR1_UART4EN
#define LL_APB1_GRP1_PERIPH_UART5         RCC_APB1ENR1_UART5EN
#define LL_APB1_GRP1_PERIPH_I2C1          RCC_APB1ENR1_I2C1EN
#define LL_APB1_GRP1_PERIPH_I2C2          RCC_APB1ENR1_I2C2EN
#define LL_APB1_GRP1_PERIPH_I3C1          RCC_APB1ENR1_I3C1EN
#define LL_APB1_GRP1_PERIPH_CRS           RCC_APB1ENR1_CRSEN
#define LL_APB1_GRP1_PERIPH_OPAMP         RCC_APB1ENR1_OPAMPEN
#define LL_APB1_GRP1_PERIPH_VREF          RCC_APB1ENR1_VREFEN
#define LL_APB1_GRP1_PERIPH_RTCAPB        RCC_APB1ENR1_RTCAPBEN
#define LL_APB1_GRP1_PERIPH_ALL           ( LL_APB1_GRP1_PERIPH_TIM2             |\
                                            LL_APB1_GRP1_PERIPH_TIM3             |\
                                            LL_APB1_GRP1_PERIPH_TIM4             |\
                                            LL_APB1_GRP1_PERIPH_TIM6             |\
                                            LL_APB1_GRP1_PERIPH_TIM7             |\
                                            LL_APB1_GRP1_PERIPH_SPI3             |\
                                            LL_APB1_GRP1_PERIPH_SPI4             |\
                                            LL_APB1_GRP1_PERIPH_WWDG             |\
                                            LL_APB1_GRP1_PERIPH_SPI2             |\
                                            LL_APB1_GRP1_PERIPH_USART2           |\
                                            LL_APB1_GRP1_PERIPH_USART3           |\
                                            LL_APB1_GRP1_PERIPH_UART4            |\
                                            LL_APB1_GRP1_PERIPH_UART5            |\
                                            LL_APB1_GRP1_PERIPH_I2C1             |\
                                            LL_APB1_GRP1_PERIPH_I2C2             |\
                                            LL_APB1_GRP1_PERIPH_I3C1             |\
                                            LL_APB1_GRP1_PERIPH_CRS              |\
                                            LL_APB1_GRP1_PERIPH_OPAMP            |\
                                            LL_APB1_GRP1_PERIPH_VREF             |\
                                            LL_APB1_GRP1_PERIPH_RTCAPB           )
/**
  * @}
  */


