stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_bus.h
/** @defgroup BUS_LL_EC_APB1_GRP2_PERIPH  APB1 GRP2 PERIPH
  * @{
  */
#if defined(I2C4)
#define LL_APB1_GRP2_PERIPH_I2C4          RCC_APB1ENR2_I2C4EN
#else
#define LL_APB1_GRP2_PERIPH_I2C4          0
#endif /* #if defined(I2C4) */
#define LL_APB1_GRP2_PERIPH_LPTIM2         RCC_APB1ENR2_LPTIM2EN
#define LL_APB1_GRP2_PERIPH_FDCAN          RCC_APB1ENR2_FDCANEN
#define LL_APB1_GRP2_PERIPH_ALL            (LL_APB1_GRP2_PERIPH_I2C4 |\
                                            LL_APB1_GRP2_PERIPH_LPTIM2 |\
                                            LL_APB1_GRP2_PERIPH_FDCAN )
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB2_GRP1_PERIPH  APB2 GRP1 PERIPH
  * @{
  */
#define LL_APB2_GRP1_PERIPH_TIM1           RCC_APB2ENR_TIM1EN
#define LL_APB2_GRP1_PERIPH_SPI1           RCC_APB2ENR_SPI1EN
#if defined(TIM8)
#define LL_APB2_GRP1_PERIPH_TIM8           RCC_APB2ENR_TIM8EN
#else
#define LL_APB2_GRP1_PERIPH_TIM8           0
#endif /* #if defined(TIM8) */
#define LL_APB2_GRP1_PERIPH_USART1         RCC_APB2ENR_USART1EN
#if defined(TIM12)
#define LL_APB2_GRP1_PERIPH_TIM12           RCC_APB2ENR_TIM12EN
#else
#define LL_APB2_GRP1_PERIPH_TIM12           0
#endif /* #if defined(TIM12) */
#define LL_APB2_GRP1_PERIPH_TIM15          RCC_APB2ENR_TIM15EN
#define LL_APB2_GRP1_PERIPH_TIM16          RCC_APB2ENR_TIM16EN
#define LL_APB2_GRP1_PERIPH_TIM17          RCC_APB2ENR_TIM17EN
#define LL_APB2_GRP1_PERIPH_SAI1           RCC_APB2ENR_SAI1EN
#define LL_APB2_GRP1_PERIPH_USB1           RCC_APB2ENR_USB1EN
#define LL_APB2_GRP1_PERIPH_I3C2           RCC_APB2ENR_I3C2EN
#define LL_APB2_GRP1_PERIPH_ALL            (LL_APB2_GRP1_PERIPH_TIM1   |\
                                            LL_APB2_GRP1_PERIPH_SPI1   |\
                                            LL_APB2_GRP1_PERIPH_TIM8  |\
                                            LL_APB2_GRP1_PERIPH_USART1 |\
                                            LL_APB2_GRP1_PERIPH_TIM12  |\
                                            LL_APB2_GRP1_PERIPH_TIM15  |\
                                            LL_APB2_GRP1_PERIPH_TIM16  |\
                                            LL_APB2_GRP1_PERIPH_TIM17  |\
                                            LL_APB2_GRP1_PERIPH_SAI1   |\
                                            LL_APB2_GRP1_PERIPH_USB1   |\
                                            LL_APB2_GRP1_PERIPH_I3C2   )
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB3_GRP1_PERIPH  APB3 GRP1 PERIPH
  * @{
  */
#define LL_APB3_GRP1_PERIPH_SYSCFG        RCC_APB3ENR_SYSCFGEN
#define LL_APB3_GRP1_PERIPH_LPUART1       RCC_APB3ENR_LPUART1EN
#define LL_APB3_GRP1_PERIPH_I2C3          RCC_APB3ENR_I2C3EN
#define LL_APB3_GRP1_PERIPH_LPTIM1        RCC_APB3ENR_LPTIM1EN
#define LL_APB3_GRP1_PERIPH_LPTIM3        RCC_APB3ENR_LPTIM3EN
#define LL_APB3_GRP1_PERIPH_LPTIM4        RCC_APB3ENR_LPTIM4EN
#define LL_APB3_GRP1_PERIPH_COMP          RCC_APB3ENR_COMPEN
#define LL_APB3_GRP1_PERIPH_ALL           (LL_APB3_GRP1_PERIPH_SYSCFG  |\
                                           LL_APB3_GRP1_PERIPH_LPUART1 |\
                                           LL_APB3_GRP1_PERIPH_I2C3    |\
                                           LL_APB3_GRP1_PERIPH_LPTIM1  |\
                                           LL_APB3_GRP1_PERIPH_LPTIM3  |\
                                           LL_APB3_GRP1_PERIPH_LPTIM4  |\
                                           LL_APB3_GRP1_PERIPH_COMP    )

/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_LL_EF_AHB1 AHB1
  * @{
  */
/**
  * @brief  Enable AHB1 peripherals clock.
  * @rmtoll AHB1ENR1    GPDMA1EN     LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    ADF1EN       LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    HSP1EN       LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    FLASHEN      LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    CRCEN        LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    TSCEN        LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    RAMCFGEN     LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    GTZC1EN      LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    SRAM4EN      LL_AHB1_GRP1_EnableClock\n
  *         AHB1ENR1    SRAM1EN      LL_AHB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_HSP1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1ENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1ENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled or not
  * @rmtoll AHB1ENR1         GPDMA1EN         LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         ADF1EN           LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         HSP1EN           LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         FLASHEN          LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         CRCEN            LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         TSCEN            LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         RAMCFGEN         LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         GTZC1EN          LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         SRAM4EN          LL_AHB1_GRP1_IsEnabledClock\n
  *         AHB1ENR1         SRAM1EN          LL_AHB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_HSP1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1ENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripherals clock.
  * @rmtoll AHB1ENR1    GPDMA1EN     LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    ADF1EN       LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    HSP1EN       LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    FLASHEN      LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    CRCEN        LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    TSCEN        LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    RAMCFGEN     LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    GTZC1EN      LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    SRAM4EN      LL_AHB1_GRP1_DisableClock\n
  *         AHB1ENR1    SRAM1EN      LL_AHB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_HSP1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1ENR1, Periphs);
}

/**
  * @brief  Force AHB1 peripherals reset.
  * @rmtoll AHB1RSTR1    GPDMA1RSTR     LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR1    ADF1RSTR       LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR1    HSP1RST        LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR1    CRCRSTR        LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR1    TSCRSTR        LL_AHB1_GRP1_ForceReset\n
  *         AHB1RSTR1    RAMCFGRSTR     LL_AHB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_HSP1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB1RSTR1, Periphs);
}

/**
  * @brief  Release AHB1 peripherals reset.
  * @rmtoll AHB1RSTR1    GPDMA1RSTR      LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR1    ADF1RSTR        LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR1    HSP1RST         LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR1    CRCRSTR         LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR1    TSCRSTR         LL_AHB1_GRP1_ReleaseReset\n
  *         AHB1RSTR1    RAMCFGRSTR      LL_AHB1_GRP1_ReleaseReset\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_HSP1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1RSTR1, Periphs);
}

/**
  * @brief  Enable AHB1 peripheral clocks in Sleep mode
  * @rmtoll AHB1SLPENR1    GPDMA1EN     LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    ADFEN        LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    HSP1SLPEN    LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    FLASHEN      LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    CRCEN        LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    TSCEN        LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    RAMCFGEN     LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    GTZC1EN      LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    ICACHESLPEN  LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1STPENR1    SRAM4EN      LL_AHB1_GRP1_EnableClockSleep\n
  *         AHB1SLPENR1    SRAM1EN      LL_AHB1_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ICACHE
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1SLPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1SLPENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clocks in Sleep mode is enabled or not
  * @rmtoll AHB1SLPENR1    GPDMA1SLPEN     LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    ADF1SLPEN       LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    HSP1SLPEN       LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    FLASHSLPEN      LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    CRCSLPEN        LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    TSCSLPEN        LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    RAMCFGSLPEN     LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    GTZC1SLPEN      LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    ICACHESLPEN     LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    SRAM4SLPEN      LL_AHB1_GRP1_IsEnabledClockSleep\n
  *         AHB1SLPENR1    SRAM1SLPEN      LL_AHB1_GRP1_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_HSP1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ICACHE
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1SLPENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripheral clocks in Sleep mode
  * @rmtoll AHB1SLPENR1    GPDMA1SLPEN     LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    ADF1SLPEN       LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    HSP1SLPEN       LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    FLASHSLPEN      LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    CRCSLPEN        LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    TSCSLPEN        LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    RAMCFGSLPEN     LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    GTZC1SLPEN      LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    ICACHESLPEN     LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    SRAM4SLPEN      LL_AHB1_GRP1_DisableClockSleep\n
  *         AHB1SLPENR1    SRAM1SLPEN      LL_AHB1_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_HSP1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_TSC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ICACHE
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  CLEAR_BIT(RCC->AHB1SLPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1SLPENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Enable AHB1 peripheral clocks in Stop mode
  * @rmtoll AHB1SLPENR1    GPDMA1STPEN     LL_AHB1_GRP1_EnableClockStop\n
  *         AHB1SLPENR1    ADF1STPEN       LL_AHB1_GRP1_EnableClockStop\n
  *         AHB1SLPENR1    FLASHSTPEN      LL_AHB1_GRP1_EnableClockStop\n
  *         AHB1SLPENR1    RAMCFGSTPEN     LL_AHB1_GRP1_EnableClockStop\n
  *         AHB1SLPENR1    GTZC1STPEN      LL_AHB1_GRP1_EnableClockStop\n
  *         AHB1STPENR1    SRAM4STPEN      LL_AHB1_GRP1_EnableClockStop\n
  *         AHB1SLPENR1    SRAM1STPEN      LL_AHB1_GRP1_EnableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1STPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1STPENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clocks in Stop mode is enabled or not
  * @rmtoll AHB1SLPENR1   GPDMA1STPEN     LL_AHB1_GRP1_IsEnabledClockStop\n
  *         AHB1SLPENR1   ADF1STPEN       LL_AHB1_GRP1_IsEnabledClockStop\n
  *         AHB1SLPENR1   FLASHSTPEN      LL_AHB1_GRP1_IsEnabledClockStop\n
  *         AHB1SLPENR1   RAMCFGSTPEN     LL_AHB1_GRP1_IsEnabledClockStop\n
  *         AHB1SLPENR1   GTZC1STPEN      LL_AHB1_GRP1_IsEnabledClockStop\n
  *         AHB1STPENR1   SRAM4STPEN      LL_AHB1_GRP1_IsEnabledClockStop\n
  *         AHB1SLPENR1   SRAM1STPEN      LL_AHB1_GRP1_IsEnabledClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClockStop(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1STPENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripheral clocks in Stop mode
  * @rmtoll AHB1SLPENR1    GPDMA1STPEN     LL_AHB1_GRP1_DisableClockStop\n
  *         AHB1SLPENR1    ADF1STPEN       LL_AHB1_GRP1_DisableClockStop\n
  *         AHB1SLPENR1    FLASHSTPEN      LL_AHB1_GRP1_DisableClockStop\n
  *         AHB1SLPENR1    RAMCFGSTPEN     LL_AHB1_GRP1_DisableClockStop\n
  *         AHB1SLPENR1    GTZC1STPEN      LL_AHB1_GRP1_DisableClockStop\n
  *         AHB1STPENR1    SRAM4STPEN      LL_AHB1_GRP1_DisableClockStop\n
  *         AHB1SLPENR1    SRAM1STPEN      LL_AHB1_GRP1_DisableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ADF1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_GTZC1 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM4 (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  CLEAR_BIT(RCC->AHB1STPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1STPENR1, Periphs);
  (void)tmpreg;
}


/**
  * @brief  Enable AHB1 peripherals clock.
  * @rmtoll AHB1ENR2    PWREN        LL_AHB1_GRP2_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP2_PERIPH_PWR
  *
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP2_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1ENR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1ENR2, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled or not
  * @rmtoll AHB1ENR2    PWREN        LL_AHB1_GRP2_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP2_PERIPH_PWR
  *
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP2_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1ENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripherals clock.
  * @rmtoll AHB1ENR2    PWREN        LL_AHB1_GRP2_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP2_PERIPH_PWR
  *
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP2_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1ENR2, Periphs);
}

/**
  * @brief  Enable AHB1 peripheral clocks in Sleep mode
  * @rmtoll AHB1SLPENR2    PWRSLPEN        LL_AHB1_GRP2_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP2_PERIPH_PWR
  *
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP2_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1SLPENR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1SLPENR2, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clocks in Sleep mode is enabled or not
  * @rmtoll AHB1SLPENR2    PWRSLPEN        LL_AHB1_GRP2_IsEnabledClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP2_PERIPH_PWR
  *
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP2_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1SLPENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripheral clocks in Sleep mode
  * @rmtoll AHB1SLPENR2    PWRSLPEN        LL_AHB1_GRP2_DisableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP2_PERIPH_PWR
  *
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP2_DisableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  CLEAR_BIT(RCC->AHB1SLPENR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1SLPENR2, Periphs);
  (void)tmpreg;
}

/**
  * @}
  */

