stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_bus.h
/** @defgroup BUS_LL_EF_AHB2_GRP1_PERIPH AHB2 GRP1 PERIPH
  * @{
  */
/**
  * @brief  Enable AHB2 peripherals clock.
  * @rmtoll AHB2ENR1      GPIOAEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      GPIOBEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      GPIOCEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      GPIODEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      GPIOEEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      GPIOFEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      GPIOGEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      GPIOHEN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      ADC12EN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      DAC1EN        LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      AESEN         LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      HASHEN        LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      RNGEN         LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      PKAEN         LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      SAESEN        LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      CCBEN         LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      SDMMC1EN      LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      SRAM2EN       LL_AHB2_GRP1_EnableClock\n
  *         AHB2ENR1      SRAM3EN       LL_AHB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM3 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB2ENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB2ENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clock is enabled or not
  * @rmtoll AHB2ENR1      GPIOAEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      GPIOBEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      GPIOCEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      GPIODEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      GPIOEEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      GPIOFEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      GPIOGEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      GPIOHEN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      ADC12EN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      DAC1EN        LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      AESEN         LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      HASHEN        LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      RNGEN         LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      PKAEN         LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      SAESEN        LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      CCBEN         LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      SDMMC1EN      LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      SRAM2EN       LL_AHB2_GRP1_IsEnabledClock\n
  *         AHB2ENR1      SRAM3EN       LL_AHB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM3 (*)
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB2ENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB2 peripherals clock.
  * @rmtoll AHB2ENR1      GPIOAEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      GPIOBEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      GPIOCEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      GPIODEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      GPIOEEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      GPIOFEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      GPIOGEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      GPIOHEN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      ADC12EN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      DAC1EN        LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      AESEN         LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      HASHEN        LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      RNGEN         LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      PKAEN         LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      SAESEN        LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      CCBEN         LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      SDMMC1EN      LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      SRAM2EN       LL_AHB2_GRP1_DisableClock\n
  *         AHB2ENR1      SRAM3EN       LL_AHB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM3 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2ENR1, Periphs);
}

/**
  * @brief  Force AHB2 peripherals reset.
  * @rmtoll AHB2RSTR1      GPIOARST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      GPIOBRST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      GPIOCRST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      GPIODRST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      GPIOERST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      GPIOFRST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      GPIOGRST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      GPIOHRST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      ADC12RST      LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      DAC1RST       LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      AESRST        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      HASHRST       LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      RNGRST        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      PKARST        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      SAESRST       LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      CCBRST        LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTR1      SDMMC1RST     LL_AHB2_GRP1_ForceReset\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB2RSTR1, Periphs);
}

/**
  * @brief  Release AHB2 peripherals reset.
  * @rmtoll AHB2RSTR1      GPIOARST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      GPIOBRST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      GPIOCRST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      GPIODRST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      GPIOERST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      GPIOFRST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      GPIOGRST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      GPIOHRST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      ADC12RST       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      DAC1RST        LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      AESRST         LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      HASHRST        LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      RNGRST         LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      PKARST         LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      SAESRST        LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      CCBRST         LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTR1      SDMMC1RST      LL_AHB2_GRP1_ReleaseReset\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2RSTR1, Periphs);
}

/**
  * @brief  Enable AHB2 peripheral clocks in Sleep mode
  * @rmtoll AHB2SLPENR1      GPIOASLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      GPIOBSLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      GPIOCSLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      GPIODSLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      GPIOESLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      GPIOFSLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      GPIOGSLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      GPIOHSLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      ADC12SLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      DAC1SLPEN     LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      AESSLPEN      LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      HASHSLPEN     LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      RNGSLPEN      LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      PKASLPEN      LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      SAESSLPEN     LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      CCBSLPEN      LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      SDMMC1SLPEN   LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      SRAM2SLPEN    LL_AHB2_GRP1_EnableClockSleep\n
  *         AHB2SLPENR1      SRAM3SLPEN    LL_AHB2_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM3 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB2SLPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB2SLPENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clocks in Sleep mode is enabled or not
  * @rmtoll AHB2SLPENR1      GPIOASLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      GPIOBSLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      GPIOCSLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      GPIODSLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      GPIOESLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      GPIOFSLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      GPIOGSLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      GPIOHSLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      ADC12SLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      DAC1SLPEN        LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      AESSLPEN         LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      HASHSLPEN        LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      RNGSLPEN         LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      PKASLPEN         LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      SAESSLPEN        LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      CCBSLPEN         LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      SDMMC1SLPEN      LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      SRAM2SLPEN       LL_AHB2_GRP1_IsEnabledClockSleep\n
  *         AHB2SLPENR1      SRAM3SLPEN       LL_AHB2_GRP1_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM3 (*)
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB2SLPENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB2 peripheral clocks in Sleep mode
  * @rmtoll AHB2SLPENR1      GPIOASLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      GPIOBSLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      GPIOCSLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      GPIODSLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      GPIOESLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      GPIOFSLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      GPIOGSLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      GPIOHSLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      ADC12SLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      DAC1SLPEN        LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      AESSLPEN         LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      HASHSLPEN        LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      RNGSLPEN         LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      PKASLPEN         LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      SAESSLPEN        LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      CCBSLPEN         LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      SDMMC1SLPEN      LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      SRAM2SLPEN       LL_AHB2_GRP1_DisableClockSleep\n
  *         AHB2SLPENR1      SRAM3SLPEN       LL_AHB2_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM3 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2SLPENR1, Periphs);
}

/**
  * @brief  Enable AHB2 peripheral clocks in Stop mode
  * @rmtoll AHB2STPENR1      GPIOASTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      GPIOBSTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      GPIOCSTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      GPIODSTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      GPIOESTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      GPIOFSTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      GPIOGSTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      GPIOHSTPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      DAC1STPEN        LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      SRAM2STPEN       LL_AHB2_GRP1_EnableClockStop\n
  *         AHB2STPENR1      SRAM3STPEN       LL_AHB2_GRP1_EnableClockStop\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SRAM3 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB2STPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB2STPENR1, Periphs);
  (void)tmpreg;
}

