stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_bus.h
/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll APB1RSTR2     I2C4RST        LL_APB1_GRP2_ReleaseReset\n
  *         APB1RSTR2     LPTIM2RST      LL_APB1_GRP2_ReleaseReset\n
  *         APB1RSTR2     FDCANRST       LL_APB1_GRP2_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_I2C4 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1RSTR2, Periphs);
}

/**
  * @brief  Enable APB1 peripheral clocks in Sleep mode
  * @rmtoll APB1SLPENR1     TIM2SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     TIM3SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     TIM4SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     TIM6SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     TIM7SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     SPI3SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     SPI4SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     WWDGSLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     SPI2SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     USART2SLPEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     USART3SLPEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     UART4SLPEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     UART5SLPEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     I2C1SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     I2C2SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     I3C1SLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     CRSSLPEN         LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     OPAMPSLPEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     VREFSLPEN        LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SLPENR1     RTCAPBSLPEN      LL_APB1_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *
  *        (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1SLPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1SLPENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Enable APB1 peripheral clocks in Sleep mode
  * @rmtoll APB1SLPENR2     I2C4SLPEN        LL_APB1_GRP2_EnableClockSleep\n
  *         APB1SLPENR2     LPTIM2SLPEN      LL_APB1_GRP2_EnableClockSleep\n
  *         APB1SLPENR2     FDCANSLPEN       LL_APB1_GRP2_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_I2C4 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1SLPENR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1SLPENR2, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clocks in Sleep mode is enabled or not
  * @rmtoll APB1SLPENR1     TIM2SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     TIM3SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     TIM4SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     TIM6SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     TIM7SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     SPI3SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     SPI4SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     WWDGSLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     SPI2SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     USART2SLPEN      LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     USART3SLPEN      LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     UART4SLPEN       LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     UART5SLPEN       LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     I2C1SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     I2C2SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     I3C1SLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     CRSSLPEN         LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     OPAMPSLPEN       LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     VREFSLPEN        LL_APB1_GRP1_IsEnabledClockSleep\n
  *         APB1SLPENR1     RTCAPBSLPEN      LL_APB1_GRP1_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *
  *        (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1SLPENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Check if APB1 peripheral clocks in Sleep mode is enabled or not
  * @rmtoll APB1SLPENR2     I2C4SLPEN        LL_APB1_GRP2_IsEnabledClockSleep\n
  *         APB1SLPENR2     LPTIM2SLPEN      LL_APB1_GRP2_IsEnabledClockSleep\n
  *         APB1SLPENR2     FDCANSLPEN       LL_APB1_GRP2_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_I2C4 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1SLPENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripheral clocks in Sleep mode
  * @rmtoll APB1SLPENR1     TIM2SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     TIM3SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     TIM4SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     TIM6SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     TIM7SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     SPI3SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     SPI4SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     WWDGSLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     SPI2SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     USART2SLPEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     USART3SLPEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     UART4SLPEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     UART5SLPEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     I2C1SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     I2C2SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     I3C1SLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     CRSSLPEN         LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     OPAMPSLPEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     VREFSLPEN        LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SLPENR1     RTCAPBSLPEN      LL_APB1_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1SLPENR1, Periphs);
}

/**
  * @brief  Disable APB1 peripheral clocks in Sleep mode
  * @rmtoll APB1SLPENR2     I2C4SLPEN        LL_APB1_GRP2_DisableClockSleep\n
  *         APB1SLPENR2     LPTIM2SLPEN      LL_APB1_GRP2_DisableClockSleep\n
  *         APB1SLPENR2     FDCANSLPEN       LL_APB1_GRP2_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_I2C4 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1SLPENR2, Periphs);
}

/**
  * @brief  Enable APB1 peripheral clocks in Stop mode
  * @rmtoll APB1STPENR1     SPI3STPEN        LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     SPI4STPEN        LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     SPI2STPEN        LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     USART2STPEN      LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     USART3STPEN      LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     UART4STPEN       LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     UART5STPEN       LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     I2C1STPEN        LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     I2C2STPEN        LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     I3C1STPEN        LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     OPAMPSTPEN       LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     VREFSTPEN        LL_APB1_GRP1_EnableClockStop\n
  *         APB1STPENR1     RTCAPBSTPEN      LL_APB1_GRP1_EnableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1STPENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1STPENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Enable APB1 peripheral clocks in Stop mode
  * @rmtoll APB1STPENR2     I2C4STPEN        LL_APB1_GRP2_EnableClockStop\n
  *         APB1STPENR2     LPTIM2STPEN      LL_APB1_GRP2_EnableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_I2C4 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1STPENR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1STPENR2, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clocks in Stop mode is enabled or not
  * @rmtoll APB1STPENR1     SPI3STPEN        LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     SPI4STPEN        LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     SPI2STPEN        LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     USART2STPEN      LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     USART3STPEN      LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     UART4STPEN       LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     UART5STPEN       LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     I2C1STPEN        LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     I2C2STPEN        LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     I3C1STPEN        LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     OPAMPSTPEN       LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     VREFSTPEN        LL_APB1_GRP1_IsEnabledClockStop\n
  *         APB1STPENR1     RTCAPBSTPEN      LL_APB1_GRP1_IsEnabledClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClockStop(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1STPENR1, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Check if APB1 peripheral clocks in Stop mode is enabled or not
  * @rmtoll APB1STPENR2     I2C4STPEN        LL_APB1_GRP2_IsEnabledClockStop\n
  *         APB1STPENR2     LPTIM2STPEN      LL_APB1_GRP2_IsEnabledClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_I2C4 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClockStop(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1STPENR2, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripheral clocks in Stop mode
  * @rmtoll APB1STPENR1     SPI3STPEN        LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     SPI4STPEN        LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     SPI2STPEN        LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     USART2STPEN      LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     USART3STPEN      LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     UART4STPEN       LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     UART5STPEN       LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     I2C1STPEN        LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     I2C2STPEN        LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     I3C1STPEN        LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     OPAMPSTPEN       LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     VREFSTPEN        LL_APB1_GRP1_DisableClockStop\n
  *         APB1STPENR1     RTCAPBSTPEN      LL_APB1_GRP1_DisableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_VREF
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockStop(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1STPENR1, Periphs);
}

/**
  * @brief  Disable APB1 peripheral clocks in Stop mode
  * @rmtoll APB1STPENR2     I2C4STPEN        LL_APB1_GRP2_DisableClockStop\n
  *         APB1STPENR2     LPTIM2STPEN      LL_APB1_GRP2_DisableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_I2C4 (*)
  *         @arg @ref LL_APB1_GRP2_PERIPH_LPTIM2
  *
  *        (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClockStop(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1STPENR2, Periphs);
}


/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */

/**
  * @brief  Enable APB2 peripherals clock.
  * @rmtoll APB2ENR      TIM1EN        LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      SPI1EN        LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      TIM8EN        LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      USART1EN      LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      TIM12EN       LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      TIM15EN       LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      TIM16EN       LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      TIM17EN       LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      SAI1EN        LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      USB1EN        LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      I3C2EN        LL_APB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM12 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB1
  *         @arg @ref LL_APB2_GRP1_PERIPH_I3C2
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2ENR, Periphs);
  (void)tmpreg;
}

