stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_bus.h
/**
  * @brief  Disable APB3 peripheral clocks in Sleep mode
  * @rmtoll APB3SLPENR      SYSCFGSLPEN      LL_APB3_GRP1_DisableClockSleep\n
  *         APB3SLPENR      LPUART1SLPEN     LL_APB3_GRP1_DisableClockSleep\n
  *         APB3SLPENR      I2C3SLPEN        LL_APB3_GRP1_DisableClockSleep\n
  *         APB3SLPENR      LPTIM1SLPEN      LL_APB3_GRP1_DisableClockSleep\n
  *         APB3SLPENR      LPTIM3SLPEN      LL_APB3_GRP1_DisableClockSleep\n
  *         APB3SLPENR      LPTIM4SLPEN      LL_APB3_GRP1_DisableClockSleep\n
  *         APB3SLPENR      COMPSLPEN        LL_APB3_GRP1_DisableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB3_GRP1_PERIPH_COMP
  * @retval None
  */
__STATIC_INLINE void LL_APB3_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB3SLPENR, Periphs);
}


/**
  * @brief  Enable APB3 peripheral clocks in Stop mode
  * @rmtoll APB3STPENR      LPUART1STPEN     LL_APB3_GRP1_EnableClockStop\n
  *         APB3STPENR      I2C3STPEN        LL_APB3_GRP1_EnableClockStop\n
  *         APB3STPENR      LPTIM1STPEN      LL_APB3_GRP1_EnableClockStop\n
  *         APB3STPENR      LPTIM3STPEN      LL_APB3_GRP1_EnableClockStop\n
  *         APB3STPENR      LPTIM4STPEN      LL_APB3_GRP1_EnableClockStop\n
  *         APB3STPENR      COMPSTPEN        LL_APB3_GRP1_EnableClockStop\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB3_GRP1_PERIPH_COMP
  * @retval None
  */
__STATIC_INLINE void LL_APB3_GRP1_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB3STPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB3STPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB3 peripheral clocks in Stop mode is enabled or not
  * @rmtoll APB3STPENR      LPUART1STPEN     LL_APB3_GRP1_IsEnabledClockStop\n
  *         APB3STPENR      I2C3STPEN        LL_APB3_GRP1_IsEnabledClockStop\n
  *         APB3STPENR      LPTIM1STPEN      LL_APB3_GRP1_IsEnabledClockStop\n
  *         APB3STPENR      LPTIM3STPEN      LL_APB3_GRP1_IsEnabledClockStop\n
  *         APB3STPENR      LPTIM4STPEN      LL_APB3_GRP1_IsEnabledClockStop\n
  *         APB3STPENR      COMPSTPEN        LL_APB3_GRP1_IsEnabledClockStop\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB3_GRP1_PERIPH_COMP
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB3_GRP1_IsEnabledClockStop(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB3STPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB3 peripheral clocks in Stop mode
  * @rmtoll APB3STPENR      LPUART1STPEN     LL_APB3_GRP1_DisableClockStop\n
  *         APB3STPENR      I2C3STPEN        LL_APB3_GRP1_DisableClockStop\n
  *         APB3STPENR      LPTIM1STPEN      LL_APB3_GRP1_DisableClockStop\n
  *         APB3STPENR      LPTIM3STPEN      LL_APB3_GRP1_DisableClockStop\n
  *         APB3STPENR      LPTIM4STPEN      LL_APB3_GRP1_DisableClockStop\n
  *         APB3STPENR      COMPSTPEN        LL_APB3_GRP1_DisableClockStop\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM4
  *         @arg @ref LL_APB3_GRP1_PERIPH_COMP
  * @retval None
  */
__STATIC_INLINE void LL_APB3_GRP1_DisableClockStop(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB3STPENR, Periphs);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U3xx_LL_BUS_H */
